Revit 2024 API
Reference.CreateReferenceInLink Method
Creates a Reference in an RVT Link from a Reference in the RVT host file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Reference CreateReferenceInLink()
Visual Basic
Public Function CreateReferenceInLink As Reference
Visual C++
public:
Reference^ CreateReferenceInLink()
See Also
Reference Class
Autodesk.Revit.DB Namespace